rushxrushx/DAPLINK_JX_MOD/CMSIS-DAP2mod/STM32/DAP_config.h
//common
	#define GPIO_INIT(port, data)	GPIO_Init(port, (GPIO_InitTypeDef *)&data)
	#define PIN_MODE_MASK(pin)		(((uint32_t)0x0F) << ((pin) << 2))
	#define PIN_MODE(mode,pin)		(((uint32_t)mode) << ((pin) << 2))
	#define PIN_MASK(pin)			(((uint16_t)0x01) << (pin))

	typedef enum Pin_e {
		PA = 0x00, PA0 = 0x00, PA1, PA2, PA3, PA4, PA5, PA6, PA7, PA8, PA9, PA10, PA11, PA12, PA13, PA14, PA15,
		PB = 0x10, PB0 = 0x10, PB1, PB2, PB3, PB4, PB5, PB6, PB7, PB8, PB9, PB10, PB11, PB12, PB13, PB14, PB15,
		PC = 0x20, PC0 = 0x20, PC1, PC2, PC3, PC4, PC5, PC6, PC7, PC8, PC9, PC10, PC11, PC12, PC13, PC14, PC15,
		PD = 0x30, PD0 = 0x30, PD1, PD2,
	} Pin_t;

//uart
	#define USART_CLOCK(state)		RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, state)
	#define USART_REMAP()			/* GPIO_PinRemapConfig(..., ENABLE) */

	#define USART_PORT			USART2
	#define USART_GPIO			GPIOA
	#define USART_TX_PIN		GPIO_Pin_2
	#define USART_RX_PIN		GPIO_Pin_3
	#define USART_IRQn			USART2_IRQn
	#define USART_IRQHandler	USART2_IRQHandler
	#define USART_BUFFER_SIZE	(256)	/*	Size of Receive and Transmit buffers MUST BE 2^n */

//usb pullup
	#define PIN_USB_CONNECT_RCC		RCC_APB2ENR_IOPAEN
	#define PIN_USB_CONNECT_PORT    GPIOA
	#define PIN_USB_CONNECT_PIN		15
	#define PIN_USB_CONNECT         PIN_MASK(PIN_USB_CONNECT_PIN)
	#define PIN_USB_MODE			GPIO_Mode_Out_PP
	#define PIN_USB_CONNECT_ON()	PIN_USB_CONNECT_PORT->BSRR  = PIN_USB_CONNECT
	#define PIN_USB_CONNECT_OFF()	PIN_USB_CONNECT_PORT->BRR = PIN_USB_CONNECT
	
	
	// SWDIO/TMS Pin
	#define PIN_SWDIO_TMS_PORT		GPIOB
	#define PIN_SWDIO_TMS_PIN		14

	// SWCLK/TCK Pin
	#define PIN_SWCLK_TCK_PORT		GPIOB
	#define PIN_SWCLK_TCK_PIN		13

	// TDO/SWO Pin (input)
	#define PIN_TDO_PORT            GPIOA
	#define PIN_TDO					6

	// nRESET Pin
	#define PIN_nRESET_PORT         GPIOB
	#define PIN_nRESET_PIN			0
	
	//LEDs
	#define LED_CONNECTED_RCC		RCC_APB2ENR_IOPAEN

	// Connected LED (GREEN)	0
	// Target Running LED (RED)	1
	// Off - float
	#define LED_CONNECTED_PORT      GPIOA
	#define LED_CONNECTED_PIN		9

	#define LED_RUNNING_PORT		GPIOA
	#define LED_RUNNING_PIN			8

	#define LED_CONNECTED			PIN_MASK(LED_CONNECTED_PIN)
	#define LED_RUNNING				PIN_MASK(LED_RUNNING_PIN)	
	

	#define PIN_nRESET				PIN_MASK(PIN_nRESET_PIN)
	#define PIN_SWDIO_TMS			PIN_MASK(PIN_SWDIO_TMS_PIN)
	#define PIN_SWCLK_TCK			PIN_MASK(PIN_SWCLK_TCK_PIN)
	
	
#if (PIN_nRESET_PIN >= 8)
	#define PIN_nRESET_LOW()							\
		do {											\
			/* GPIO_Mode_Out_OD | GPIO_Speed_50MHz */	\
			PIN_nRESET_PORT->CRH = (PIN_nRESET_PORT->CRH & ~PIN_MODE_MASK(PIN_nRESET_PIN - 8))	\
									| PIN_MODE(((GPIO_Mode_Out_OD | GPIO_Speed_50MHz) & 0x0F), PIN_nRESET_PIN - 8);	\
		} while (0)

	#define PIN_nRESET_HIGH()							\
		do {											\
			PIN_nRESET_PORT->CRH = (PIN_nRESET_PORT->CRH & ~PIN_MODE_MASK(PIN_nRESET_PIN - 8))	\
									| PIN_MODE(GPIO_Mode_IN_FLOATING, PIN_nRESET_PIN - 8);		\
		} while (0)
#else
	#define PIN_nRESET_LOW()							\
		do {											\
			/* GPIO_Mode_Out_OD | GPIO_Speed_50MHz */	\
			PIN_nRESET_PORT->CRL = (PIN_nRESET_PORT->CRL & ~PIN_MODE_MASK(PIN_nRESET_PIN))	\
									| PIN_MODE(((GPIO_Mode_Out_OD | GPIO_Speed_50MHz) & 0x0F), PIN_nRESET_PIN);	\
		} while (0)

	#define PIN_nRESET_HIGH()							\
		do {											\
			PIN_nRESET_PORT->CRL = (PIN_nRESET_PORT->CRL & ~PIN_MODE_MASK(PIN_nRESET_PIN))	\
									| PIN_MODE(GPIO_Mode_IN_FLOATING, PIN_nRESET_PIN);		\
		} while (0)
#endif

//	For fast switch between input and output mode
//	without GPIO_Init call
#if (PIN_SWDIO_TMS_PIN >= 8)
	#define PIN_SWDIO_TMS_OUT_DISABLE()					\
		do {											\
			PIN_SWDIO_TMS_PORT->CRH = (PIN_SWDIO_TMS_PORT->CRH & ~PIN_MODE_MASK(PIN_SWDIO_TMS_PIN - 8)) | PIN_MODE(0x8, PIN_SWDIO_TMS_PIN - 8);	\
			PIN_SWDIO_TMS_PORT->BSRR = PIN_SWDIO_TMS;	\
		} while (0)

	#define PIN_SWDIO_TMS_OUT_ENABLE()					\
		do {											\
			PIN_SWDIO_TMS_PORT->CRH = (PIN_SWDIO_TMS_PORT->CRH & ~PIN_MODE_MASK(PIN_SWDIO_TMS_PIN - 8)) | PIN_MODE(0x3, PIN_SWDIO_TMS_PIN - 8);	\
			PIN_SWDIO_TMS_PORT->BRR  = PIN_SWDIO_TMS;	\
		} while (0)
#else
	#define PIN_SWDIO_TMS_OUT_DISABLE()					\
		do {											\
			PIN_SWDIO_TMS_PORT->CRL = (PIN_SWDIO_TMS_PORT->CRL & ~PIN_MODE_MASK(PIN_SWDIO_TMS_PIN)) | PIN_MODE(0x8, PIN_SWDIO_TMS_PIN);	\
			PIN_SWDIO_TMS_PORT->BSRR = PIN_SWDIO_TMS;	\
		} while (0)

	#define PIN_SWDIO_TMS_OUT_ENABLE()					\
		do {											\
			PIN_SWDIO_TMS_PORT->CRL = (PIN_SWDIO_TMS_PORT->CRL & ~PIN_MODE_MASK(PIN_SWDIO_TMS_PIN)) | PIN_MODE(0x3, PIN_SWDIO_TMS_PIN);	\
			PIN_SWDIO_TMS_PORT->BRR  = PIN_SWDIO_TMS;	\
		} while (0)

#endif


// Configure DAP I/O pins ------------------------------

/** Setup JTAG I/O pins: TCK, TMS, TDI, TDO, nTRST, and nRESET.
Configures the DAP Hardware I/O pins for JTAG mode:
 - TCK, TMS, TDI, nTRST, nRESET to output mode and set to high level.
 - TDO to input mode.
*/
__STATIC_INLINE void PORT_JTAG_SETUP (void) {
  ;
}

/** Setup SWD I/O pins: SWCLK, SWDIO, and nRESET.
Configures the DAP Hardware I/O pins for Serial Wire Debug (SWD) mode:
 - SWCLK, SWDIO, nRESET to output mode and set to default high level.
 - TDI, nTRST to HighZ mode (pins are unused in SWD mode).
*/
__STATIC_INLINE void PORT_SWD_SETUP (void) {

  GPIO_InitTypeDef INIT_SWD_PINS = {
	PIN_SWCLK_TCK | PIN_SWDIO_TMS,
	GPIO_Speed_50MHz,
	GPIO_Mode_Out_PP
};

	PIN_SWCLK_TCK_PORT->BSRR = (PIN_SWCLK_TCK | PIN_SWDIO_TMS);
	//PIN_nRESET_PORT->BRR = PIN_nRESET;

	GPIO_INIT(PIN_SWCLK_TCK_PORT, INIT_SWD_PINS);
	//PIN_nRESET_HIGH();
}

/** Disable JTAG/SWD I/O Pins.
Disables the DAP Hardware I/O pins which configures:
 - TCK/SWCLK, TMS/SWDIO, TDI, TDO, nTRST, nRESET to High-Z mode.
*/
__STATIC_INLINE void PORT_OFF (void) {
  
  const GPIO_InitTypeDef INIT_OFF_1 = {
	(PIN_SWCLK_TCK | PIN_SWDIO_TMS),
	(GPIOSpeed_TypeDef)0,
	GPIO_Mode_IPU
};
const GPIO_InitTypeDef INIT_OFF_2 = {
	(PIN_nRESET),
	(GPIOSpeed_TypeDef)0,
	GPIO_Mode_IPU
};

	GPIO_INIT(PIN_SWCLK_TCK_PORT, INIT_OFF_1);
	GPIO_INIT(PIN_nRESET_PORT,    INIT_OFF_2);
}


// SWCLK/TCK I/O pin -------------------------------------

/** SWCLK/TCK I/O pin: Get Input.
\return Current status of the SWCLK/TCK DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_SWCLK_TCK_IN  (void) {
  return (PIN_SWCLK_TCK_PORT->ODR & PIN_SWCLK_TCK) ? 1 : 0;
  
